# SQL 4 Data Science: Predict Project
## Bhejane Online Trading Store

### Student Starter Notebook

Â© Explore Data Science Academy

### Honour Code

I {**HASSAN**, **JUMA**}, confirm - by submitting this document - that the solutions in this notebook are a result of my own work and that I abide by the EDSA honour code (https://drive.google.com/file/d/1QDCjGZJ8-FmJE3bZdIQNwnJyQKPhHZBn/view?usp=sharing).

Non-compliance with the honour code constitutes a material breach of contract.

<a id='Context'></a>
### 1. Context

<div align="center" style="width: 600px; font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/Bhejane_large.jpg"
     alt="The Black Rhino"
     style="float: center; padding-bottom=0.5em"
     width=600px/>
     Bhejane, or the Black Rhino. Image by <a href="https://commons.wikimedia.org/wiki/File:Black_Rhino_(Diceros_bicornis)_browsing_..._(46584052962).jpg">Wikimedia Commons</a>
</div>


The Bhejane trading store is an online retailer specialising in Covid essesstial items. The store has recently be struggling with the management of its database-related inventory system. Luckily for them, you've been hired as a consultant to fix the problem. 

Its time to flex your Ninja SQL skills! 
 
**Your mission, should you choose to accept it:**

You will receive a denormalised database consisting of two tables. Your task is to transform the database such that is in third normal form (3NF). To ensure that a consistent normalisation process is followed by each student, we have attached an Entity Relationship Diagram (ERD) which is a guideline on what tables need to be produced. Once you have normalised the databasse, you will be required to complete an MCQ test found under the 'Predict' tab of Athena.

<a id='Imports'></a>
### 2. Imports
Please use the below command to install sql_magic, this is the package that will assist you with SQL syntax hightlighting.
* pip install sql_magic

Remember to start each new cell with " %%read_sql "

In [2]:
# DO NOT EDIT THIS CELL
import sqlite3
import csv
from sqlalchemy import create_engine
%load_ext sql_magic

# Load SQLite database
engine  = create_engine("sqlite:///bhejane.db")
%config SQL.conn_name ='engine'

The sql_magic extension is already loaded. To reload it, use:
  %reload_ext sql_magic

<a id='Data_description'></a>
### 3. Data description

The original database consist of 2 tables. 
* Product Table
* Transaction Table

In [3]:
# DO NOT EDIT THIS CELL
import pandas as pd
data_description = pd.read_excel('Data Description.xlsx')
data_description

,Table Name,Column Name,Desciption
0,Products,Width,Width of the product once assembled
1,Products,Length,Length of the product once assembled
2,Products,Height,Height of the product once assembled
3,Products,Barcode,The unique product identifier
4,Products,Quantity,Number of goods in stock
5,Products,Brand,Product brand name relating to product company
6,Products,NavigationPath,Navigation path to specific product
7,Products,Colour,Name default colour for the product
8,Products,StockCountry,Country where the stock was bought from
9,Products,ProductDescription,Descriptive product name
10,Products,PackType,The way in which the product is packaged
11,Products,Volume_litre,The quantity of liquid based products
12,Products,Warranty,Product warranty type
13,Products,Weight_kg,Weight of the product
14,Products,ItemDescription,Description of contents of the package
15,Products,Price,The cost of the product in Rands
16,Transactions,CartID,Identifies an individual basket from a user pu...
17,Transactions,Barcode,Barcode for item that user purchased
18,Transactions,Total,Total value of a transaction
19,Transactions,UserName,Name of customer purchasing stock
20,Transactions,InvoiceDate,Date on which the product was bought

<a id='Setting_up'></a>
### 4. Setting up the database

In [5]:
#DO NOT EDIT THIS CELL
conn = sqlite3.connect('bhejane.db')
cursor = conn.cursor()

#### Creating both Products and Transaction Tables

In [6]:
%%read_sql
--DO NOT EDIT THIS CELL
DROP TABLE IF EXISTS "Products";
DROP TABLE IF EXISTS "Transactions";

CREATE TABLE "Products" (
    "Width"   REAL,
    "Length"  REAL,
    "Height"  REAL,
    "Barcode" VARCHAR(150) NOT NULL,
    "Quantity" INTEGER NOT NULL,
    "Brand" VARCHAR(150), 
    "NavigationPath" VARCHAR(150),
    "Colour" VARCHAR(150),
    "StockCountry" VARCHAR(150),
    "ProductDescription" VARCHAR(150) NOT NULL,
    "PackType" VARCHAR(150), 
    "Volume_litre" REAL, 
    "Warranty" VARCHAR(150), 
    "Weight_kg" REAL,
    "ItemDescription" VARCHAR(150), 
    "Price" REAL
);


CREATE TABLE "Transactions" (
    "CartID" INTEGER,
    "Barcode" VARCHAR(150), 
    "Total" REAL,
    "UserName" VARCHAR(150), 
    "InvoiceDate" DATETIME
);

Query started at 05:55:19 PM EAT; Query executed in 0.00 m

#### Load Data into Product and Transaction tables

In [8]:
# DO NOT EDIT CELL
# Load data into Product table
with open('bhejane_covid_essentials_Products.csv','r') as fin: # `with` statement available in 2.5+
    # csv.DictReader uses first line in file for column headings by default
    dr = csv.DictReader(fin) # comma is default delimiter
    to_db = [(i['Width'],i['Length'],i['Height'], i['Barcode'], i['Quantity'], i['Brand'], i['NavigationPath'], i['Colour'], i['StockCountry'], i['ProductDescription'],i['PackType'],i['Volume_litre'],i['Warranty'],i['Weight_kg'],i["ItemDescription"],i['Price']) for i in dr]

cursor.executemany("INSERT INTO Products VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?);", to_db)
conn.commit()

with open('bhejane_covid_essentials_Transactions.csv','r') as fin: # `with` statement available in 2.5+
    # csv.DictReader uses first line in file for column headings by default
    dr = csv.DictReader(fin) # comma is default delimiter
    to_db = [(i['CartID'],i['Barcode'], i['Total'], i['UserName'], i['InvoiceDate']) for i in dr]

cursor.executemany("INSERT INTO Transactions VALUES (?, ?, ?, ?, ?);", to_db)
conn.commit()

<a id='ERD'></a>
### 5. Denormalized Database Tables


<br>

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/Denormalized_Tables.png" alt="Denormalized Tables" border="0">

#### 5.1 Explore the Denormalized Tables
Familiarize yourself with the data given in the two tables by writing your own SQL queries to explore properties of the dataset.i.e Look for data inconsistencies, anormalies, redundancies etc to guide your normalization process. 

This section will not be graded - think of it as your own scratch pad.

In [9]:
%%read_sql
-- #Use this section to explore the database by writing your own queries
SELECT * FROM Products
LIMIT 2;

Query started at 05:55:36 PM EAT; Query executed in 0.00 m

,Width,Length,Height,Barcode,Quantity,Brand,NavigationPath,Colour,StockCountry,ProductDescription,PackType,Volume_litre,Warranty,Weight_kg,ItemDescription,Price
0,,,,300507946,493,Hikvision,Computers & Tablets / Smart Home & Connected L...,,,Hikvision 1080P 2MP Turbo HD IR Bullet Camera,,0.0,Limited (6 months),,1 x Hikvision 1080P Bullet camera,399.0
1,,,,300507946,493,Hikvision,Computers & Tablets / Smart Home & Connected L...,,,Hikvision 1080P 2MP Turbo HD IR Bullet Camera,,0.0,Limited (6 months),,Manual,399.0

In [10]:
%%read_sql
UPDATE Products
SET Colour = 'Silver'
WHERE Colour = 'Sliver'

Query started at 05:55:51 PM EAT; Query executed in 0.00 m

### 6. Normalize the given Database tables to the 1st Normal Form (1NF)

Given the below below target ERD create new tables such the the database conforms to the 1st Normal Form

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/1NF.png" alt="1st Normal Form ERD" border="0">

It is suggested that you create all your tables before attempting to populate them with data, this will help reduce errors that might creep up due to logical dependencies.

#### 6.1 Create the tables required for the 1st Normal Form
Use the above ERD sketch to create the required tables. Please label your tables as they appear in the ERD sketch

In [11]:
%%read_sql
--#Create tables required for 1NF
DROP TABLE IF EXISTS Products_1NF;
DROP TABLE IF EXISTS Transactions_1NF;

CREATE TABLE Products_1NF(
    
    Barcode VARCHAR(150) NOT NULL,
    NavigationPath VARCHAR(150) NOT NULL,
    ItemDescription VARCHAR(150) NOT NULL ,   
    ProductDescription VARCHAR(150) NOT NULL,
    Brand VARCHAR(150),
    Price REAL NOT NULL,
    Quantity INTEGER NOT NULL,
    PackType VARCHAR(150),
    Warranty VARCHAR(150),
    StockCountry VARCHAR (150),
    Colour VARCHAR(150),
    Weight_kg REAL,
    Volume_litre REAL,
    Length REAL,
    Width REAL,
    Height REAL,
    PRIMARY KEY (Barcode,NavigationPath,ItemDescription)
);

CREATE TABLE Transactions_1NF (
    CartID INTEGER NOT NULL,
    Barcode VARCHAR(150) NOT NULL,
    UserName VARCHAR(150) NOT NULL,
    InvoiceDate DATETIME NOT NULL,
    Total REAL NOT NULL,
    PRIMARY KEY (CartID,Barcode)
);

Query started at 05:55:58 PM EAT; Query executed in 0.00 m

#### 6.2 Populate the tables you have create in the above section.

Populate the tables such that the database conforms to the 1st Normal Form

In [12]:
%%read_sql
--#Populate the 1NF tables
DELETE FROM Products_1NF;
DELETE FROM Transactions_1NF;

INSERT INTO Products_1NF (Barcode,NavigationPath, ItemDescription,ProductDescription, Brand, Price, Quantity, 
                          PackType,  Warranty, StockCountry, Colour,Weight_kg, Volume_litre, Length, Width,  Height)                   
    SELECT DISTINCT Barcode,NavigationPath, ItemDescription,ProductDescription, Brand, Price, 
                Quantity, PackType,  Warranty, StockCountry, Colour,Weight_kg, Volume_litre, Length, Width,  Height                
FROM Products;


INSERT INTO Transactions_1NF (CartID, Barcode, UserName, InvoiceDate,Total)
    SELECT DISTINCT CartID, Barcode, UserName, InvoiceDate,Total
FROM Transactions;

Query started at 05:56:06 PM EAT; Query executed in 0.00 m

###  7. Convert the database into its 2nd Normal Form (2NF).

Please label your tables as they appear in the ERD sketch.

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/2NF.png" alt="2nd Normal Form ERD" border="0">

In [13]:
%%read_sql
--#Create tables required for 2NF
DROP TABLE IF EXISTS Products_2NF;
DROP TABLE IF EXISTS Navigation_2NF;
DROP TABLE IF EXISTS PackageContents_2NF;
DROP TABLE IF EXISTS Colours_2NF;
DROP TABLE IF EXISTS Transactions_2NF;

CREATE TABLE Products_2NF(
    
    RegistryID INTEGER NOT NULL,
    Barcode VARCHAR(150) NOT NULL,
    ProductDescription VARCHAR(150) NOT NULL,
    Brand VARCHAR(150),
    Price REAL NOT NULL,
    Quantity INTEGER NOT NULL,
    StockCountry VARCHAR(150),
    Weight_kg REAL,
    Volume_litre REAL,
    Length REAL,
    Width REAL,
    Height REAL,
    PathID INTEGER NOT NULL,
    ItemID INTEGER NOT NULL,
    ColourID INTEGER NOT NULL,
    PRIMARY KEY (RegistryID),
    
   
    CONSTRAINT fk_Barcode
    FOREIGN KEY (Barcode)
    REFERENCES Transactions_2NF,
    
    CONSTRAINT fk_PathID
    FOREIGN KEY (PathID)
    REFERENCES Navigation_2NF,
    

    CONSTRAINT fk_ItemID
    FOREIGN KEY (ItemID)
    REFERENCES PackageContents_2NF,
    

    CONSTRAINT fk_ColourID
    FOREIGN KEY (ColourID)
    REFERENCES Colours_2NF
    
);

CREATE TABLE Navigation_2NF(
    PathID INTEGER NOT NULL,
    NavigationPath VARCHAR(150),
    PRIMARY KEY (PathID)
);

CREATE TABLE PackageContents_2NF(
    ItemID INTEGER NOT NULL,
    ItemDescription VARCHAR(150),
    PackType VARCHAR (150),
    Warranty VARCHAR (150),
    PRIMARY KEY (ItemID)
);

CREATE TABLE Colours_2NF(
    Colour VARCHAR (150),
    ColourID INTEGER NOT NULL,
    PRIMARY KEY (ColourID)
);

CREATE TABLE Transactions_2NF(
    CartID INTEGER NOT NULL,
    Barcode VARCHAR (150) NOT NULL,
    UserName VARCHAR(150) NOT NULL,
    InvoiceDate DATETIME NOT NULL,
    Total REAL NOT NULL,
    PRIMARY KEY (CartID,Barcode)
);

Query started at 05:56:13 PM EAT; Query executed in 0.00 m

In [16]:
%%read_sql
-- #Populate the tables so that they conform to 2NF
DELETE FROM Navigation_2NF;
DELETE FROM PackageContents_2NF;
DELETE FROM Colours_2NF;
DELETE FROM Transactions_2NF;
DELETE FROM Products_2NF;

INSERT INTO Navigation_2NF (NavigationPath) 
SELECT 
    DISTINCT NavigationPath
FROM Products_1NF;

INSERT INTO PackageContents_2NF (ItemDescription,PackType,Warranty) 
SELECT 
    DISTINCT ItemDescription, PackType,Warranty
FROM Products_1NF;

INSERT INTO Colours_2NF (Colour) 
SELECT 
    DISTINCT  Colour
FROM Products_1NF;

INSERT INTO Transactions_2NF(CartID,Barcode,UserName,InvoiceDate,Total)
SELECT 
    DISTINCT CartID, Barcode,UserName,InvoiceDate,Total
FROM Transactions_1NF;

INSERT INTO Products_2NF (Barcode,ProductDescription,
                          Brand,Price,Quantity,StockCountry,Weight_kg, 
                          Volume_litre,Length,Width,Height,PathID,ItemID,ColourID)
                          
            SELECT Barcode,ProductDescription,
                        Brand,Price,Quantity,StockCountry,Weight_kg, 
                        Volume_litre,Length,Width,Height,PathID,ItemID,ColourID
FROM Products_1NF as P               
    Join Navigation_2NF as N
     ON    N.NavigationPath=P.NavigationPath
    Join PackageContents_2NF as pc
     ON    pc.ItemDescription=p.ItemDescription
    Join Colours_2NF as C
     ON    C.Colour = P.Colour

Query started at 05:58:08 PM EAT; Query executed in 0.00 m

<a id='Target_ERD'></a>
### 8. Convert the table into its 3rd Normal Form (3NF)

Please label your tables as they appear in the ERD sketch

<br>

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/3NF.png" alt="3rd Normal Form ERD" border="0"></a>

In [18]:
%%read_sql

--#Create tables required for 3NF
DROP TABLE IF EXISTS Products_3NF;
DROP TABLE IF EXISTS Users_3NF;
DROP TABLE IF EXISTS Transactions_3NF;
DROP TABLE IF EXISTS Navigation_3NF;
DROP TABLE IF EXISTS PackageContents_3NF;
DROP TABLE IF EXISTS Colours_3NF;
DROP TABLE IF EXISTS Brands_3NF;
DROP TABLE IF EXISTS Locations_3NF;

CREATE TABLE Products_3NF(
    
    RegistryID INTEGER NOT NULL,
    Barcode VARCHAR(150) NOT NULL,
    ProductDescription VARCHAR NOT NULL,
    Price REAL NOT NULL,
    Quantity INTEGER NOT NULL,
    Weight_kg REAL,
    Volume_litre REAL,
    Length REAL,
    Width REAL,
    Height REAL,
    PathID INTEGER,
    ItemID INTEGER,
    ColourID INTEGER,
    BrandID INTEGER,
    LocationID INTEGER,
    PRIMARY KEY (RegistryID)
    
    
    CONSTRAINT fk_Barcode
    FOREIGN KEY (Barcode)
    REFERENCES Transactions_3NF,
    
    CONSTRAINT fk_PathID
    FOREIGN KEY (PathID)
    REFERENCES Navigation_3NF,
    
    CONSTRAINT fk_ItemID
    FOREIGN KEY (ItemID)
    REFERENCES PackageContents_3NF,
    
    CONSTRAINT fk_ColourID
    FOREIGN KEY (ColourID)
    REFERENCES Colours_3NF,
    
    CONSTRAINT fk_BrandID
    FOREIGN KEY (BrandID)
    REFERENCES Brands_3NF,
    
    CONSTRAINT fk_LocationID
    FOREIGN KEY (LocationID)
    REFERENCES Locations_3NF
    
    
);

CREATE TABLE Users_3NF(
    UserID INTEGER NOT NULL,
    UserName VARCHAR (150) NOT NULL,
    PRIMARY KEY(UserID)
);

CREATE TABLE Transactions_3NF(
    CartID INTEGER NOT NULL,
    Barcode VARCHAR(150) NOT NULL,
    UserID INTEGER NOT NULL,
    InvoiceDate DATETIME NOT NULL,
    Total REAL NOT NULL,
    PRIMARY KEY (CartID,Barcode)
    
    CONSTRAINT fk_UserID
    FOREIGN KEY (UserID)
    REFERENCES Users_3NF

);

CREATE TABLE Navigation_3NF (
    PathID INTEGER NOT NULL,
    NavigationPath VARCHAR(150),
    PRIMARY KEY (PathID)
);

CREATE TABLE PackageContents_3NF(
    ItemID INTEGER NOT NULL,
    ItemDescription VARCHAR(150),
    PackType VARCHAR(150),
    Warranty VARCHAR (150),
    PRIMARY KEY (ItemID)
);

CREATE TABLE Colours_3NF(
    ColourID INTEGER NOT NULL,
    Colour VARCHAR(150),
    PRIMARY KEY (ColourID)
);

CREATE TABLE Brands_3NF(
    BrandID INTEGER NOT NULL,
    Brand VARCHAR (150),
    PRIMARY KEY (BrandID)
);

CREATE TABLE Locations_3NF(
    LocationID INTEGER NOT NULL,
    StockCountry VARCHAR(150),
    PRIMARY KEY (LocationID)
)

Query started at 05:59:26 PM EAT; Query executed in 0.00 m

In [27]:
%%read_sql

--# Populate the tables to that they conform to the 3rd Normal Form
DELETE FROM Products_3NF;
DELETE FROM Users_3NF;
DELETE FROM Transactions_3NF;
DELETE FROM Products_3NF;
DELETE FROM Navigation_3NF;
DELETE FROM PackageContents_3NF;
DELETE FROM Colours_3NF;
DELETE FROM Brands_3NF;
DELETE FROM Locations_3NF;

INSERT INTO Users_3NF (UserName)
SELECT 
    DISTINCT UserName
FROM Transactions_2NF;

INSERT INTO Transactions_3NF (CartID,Barcode,InvoiceDate,Total,UserID)
SELECT 
    DISTINCT CartID,Barcode,InvoiceDate,Total,UserID
FROM Transactions_2NF as T
JOIN Users_3NF as U
ON T.UserName= U.UserName;

INSERT INTO Navigation_3NF (NavigationPath)
SELECT
    DISTINCT (NavigationPath)
FROM Navigation_2NF;

INSERT INTO PackageContents_3NF (ItemDescription,PackType,Warranty)
SELECT 
    DISTINCT ItemDescription,Packtype,Warranty
FROM PackageContents_2NF;

INSERT INTO Colours_3NF (Colour)
SELECT 
    DISTINCT Colour
FROM Colours_2NF;

INSERT INTO Brands_3NF (Brand)
SELECT 
    DISTINCT Brand
FROM Products_2NF;

INSERT INTO Locations_3NF (StockCountry)
SELECT 
    DISTINCT StockCountry
FROM Products_2NF;


INSERT INTO Products_3NF (RegistryID,Barcode,ProductDescription,Price,Quantity,
                          Weight_kg,Volume_litre,Length,Width,Height,PathID,
                          ItemID,ColourID,BrandID,LocationID)
                          
SELECT  RegistryID,Barcode,ProductDescription,Price,Quantity,
                Weight_kg,Volume_litre,Length,Width,Height,P.PathID,
                P.ItemID,P.ColourID,P.Brand,LocationID
                
FROM Products_2NF as P               
    Join Navigation_3NF as N
    ON    N.PathID=P.PathID
    Join PackageContents_3NF as pc
    ON    pc.ItemID=P.ItemID
    Join Colours_3NF as C
    ON  C.ColourID = P.ColourID
    Join Brands_3NF as B
    ON B.Brand = P.Brand
    Join Locations_3NF AS L
    ON L.StockCountry =P.StockCountry

Query started at 06:03:49 PM EAT; Query executed in 0.00 m

<a id='MCQ_questions'></a>
## 9. MCQ Questions

Having completed the normalisation of the database, you may use the following cells to help you answer the MCQs for the predict.

Q1) How many unique products does the company have?

In [31]:
%%read_sql
-- Write your query here:
SELECT COUNT (DISTINCT(Barcode)) AS UniqueProducts
FROM Products_3NF;

Query started at 06:06:18 PM EAT; Query executed in 0.00 m

   UniqueProducts
0             608

Q2) How many users bought from Bhejane in April 2020?

In [33]:
%%read_sql
-- Write your query here:
SELECT Count(Distinct(UserID)) AS Users
FROM Transactions_3NF
WHERE InvoiceDate LIKE '2020-04-%'

Query started at 06:09:39 PM EAT; Query executed in 0.00 m

   Users
0     31

Q3) How many users bought three or more items whose combined total was more than R1000 in a single transaction?

In [44]:
%%read_sql
-- Write your query here:
SELECT COUNT(*)
FROM (SELECT SUM(DISTINCT Total)
FROM Transactions_3NF
WHERE Total > 1000
Group BY InvoiceDate
Having COUNT(Barcode)>=3) AS C

Query started at 06:17:04 PM EAT; Query executed in 0.00 m

   COUNT(*)
0        11

Q4) Which user(s) made the largest purchase on a sinlge transaction?

In [49]:
%%read_sql
-- Write your query here
SELECT U.UserName
FROM Transactions_3NF AS T
INNER JOIN Users_3NF AS U
ON t.UserID=u.UserID
GROUP BY InvoiceDate
ORDER BY Total DESC
LIMIT 2;

Query started at 06:20:22 PM EAT; Query executed in 0.00 m

  UserName
0   Mandla
1  Mzoxolo

Q5) How many components does the product: "5m Colour Changing RGB LED Strip Light" (MPTAL57588104) come with?

In [53]:
%%read_sql
-- Write your query here
SELECT ProductDescription,COUNT(DISTINCT ItemDescription) AS components
FROM Products_3NF AS P
INNER JOIN PackageContents_3NF AS C
ON P.ItemID=C.ItemID
WHERE ProductDescription = '5m Colour Changing RGB LED Strip Light'

Query started at 06:22:46 PM EAT; Query executed in 0.00 m

                       ProductDescription  components
0  5m Colour Changing RGB LED Strip Light           4

Q6) How many brands are available at Bhejane?

In [60]:
%%read_sql
-- Write your query here:
SELECT COUNT(*) AS BRANDS_NOs
FROM (SELECT DISTINCT(Brand)
FROM Brands_3NF
WHERE Brand  NOT NULL
ORDER BY Brand) AS JJ

--232brands as one is blank

Query started at 06:26:08 PM EAT; Query executed in 0.00 m

   BRANDS_NOs
0         233

7) What is the price of the "Verimark - Floorwiz 2in1 Mop"?

In [61]:
%%read_sql
-- Write your query here:
SELECT Price
FROM Products_3NF
WHERE ProductDescription = 'Verimark - Floorwiz 2in1 Mop'
LIMIT 1;

Query started at 06:31:11 PM EAT; Query executed in 0.00 m

   Price
0  179.0

Q8) Calculate the package volume of the "Russell Hobbs - Slow Cooker" using the given dimensions. Round your answer to the nearest integer and ignore units for the calculation.

In [63]:
%%read_sql
-- Write your query here:
SELECT ROUND(Length*Width*Height) AS Volume
FROM Products_3NF
WHERE ProductDescription ='Russell Hobbs - Slow Cooker'
LIMIT 1;

Query started at 06:31:59 PM EAT; Query executed in 0.00 m

    Volume
0  26928.0

Q9) Which user made the most transactions in the Year 2020?

In [67]:
%%read_sql
-- Write your query here:
SELECT COUNT(T.UserID) AS Users, UserName
FROM Transactions_3NF AS T
INNER JOIN Users_3NF AS U 
ON T.UserID= U.UserID
GROUP BY T.UserID
ORDER BY Users DESC
LIMIT 1;

--All invoices are in 2020 so don't need to include date contraint

Query started at 06:35:04 PM EAT; Query executed in 0.00 m

   Users  UserName
0      9  Cornelis

Q10) What is the total number of recorded users that shop at Bhejane?

In [72]:
%%read_sql
-- Write your query here:
SELECT COUNT(DISTINCT(UserName)) AS TotalUsers
FROM Users_3NF
WHERE UserName IS NOT NULL;

-- come back to this q.. not all recorded users shop right?

Query started at 06:38:29 PM EAT; Query executed in 0.00 m

   TotalUsers
0         160

Q11) What is the record count for the Colours_3NF Table?

In [77]:
%%read_sql
-- Write your query here:
SELECT count( distinct Colour) as colours
FROM Colours_3NF;

Query started at 06:40:58 PM EAT; Query executed in 0.00 m

   colours
0       18

Q12) What would the total price be if I had the following items in my cart?
* MPTAL57588104
* 5000394203921
* 6932391917652

In [80]:
%%read_sql
-- Write your query here
SELECT SUM(Price)
FROM (SELECT Price, Barcode
FROM Products_3NF
WHERE Barcode = 'MPTAL57588104'
OR Barcode ='5000394203921'
OR Barcode ='6932391917652'
GROUP BY Barcode)

Query started at 06:44:39 PM EAT; Query executed in 0.00 m

   SUM(Price)
0       734.0

In [29]:
%%read_sql
SELECT DISTINCT(Price), Barcode, SUM(DISTINCT(Price))
FROM Products_3NF
WHERE Barcode = 'MPTAL57588104'
OR Barcode ='5000394203921'
OR Barcode ='6932391917652'

Query started at 10:20:52 AM South Africa Standard Time; Query executed in 0.00 m

   Price        Barcode  SUM(DISTINCT(Price))
0   35.0  5000394203921                 734.0

Q13) What is the barcode of the most sold product?

In [30]:
%%read_sql

-- Write your query here
SELECT Barcode, COUNT (Barcode)
FROM Transactions_3NF
GROUP BY Barcode
ORDER BY COUNT(Barcode) DESC

Query started at 10:20:55 AM South Africa Standard Time; Query executed in 0.00 m

              Barcode  COUNT (Barcode)
0       4015400541813                4
1       MPTAL00404857                3
2    HURACANNANOWAVE1                3
3       6009686620537                3
4       6001865825405                3
..                ...              ...
218     5000394020146                1
219     4902505163104                1
220       43859499182                1
221     4210201043577                1
222         300507946                1

[223 rows x 2 columns]

Q14) What are the products of Cornelisâ cart on the 2020-06-28 0:00:00?

In [31]:
%%read_sql

-- Write your query here:
SELECT DISTINCT(ProductDescription), InvoiceDate, UserName
FROM Products_3NF AS p
INNER JOIN Transactions_3NF as t
ON p.Barcode=t.Barcode
INNER JOIN Users_3NF as u
ON u.UserID= t.UserID

WHERE UserName LIKE '%Cornelis%' 
AND InvoiceDate LIKE '2020-06-28 0:00:00'

Query started at 10:20:57 AM South Africa Standard Time; Query executed in 0.00 m

,ProductDescription,InvoiceDate,UserName
0,Dettol Body Wash - Shower Gel - Original - 600ml,2020-06-28 0:00:00,Cornelis
1,Vitality Aloe Vera Gel 100ml,2020-06-28 0:00:00,Cornelis
2,Sparq Active Resistance Loop Band - Set of 5 w...,2020-06-28 0:00:00,Cornelis
3,Protective Face Shield,2020-06-28 0:00:00,Cornelis

Q15) Which users bought locally produced, black-coloured products on odd-numbered months of the year, and what was the total cost (rounded to the nearest integer) of these products?

In [32]:
%%read_sql

--Write your query here
SELECT  UserName, StockCountry,Total,InvoiceDate, Colour
FROM Products_3NF AS p
INNER JOIN Locations_3NF AS l
ON l.LocationID=p.LocationID
INNER JOIN Transactions_3NF AS t
ON t.Barcode=p.Barcode
INNER JOIN Users_3NF AS u
ON u.userID=t.userID
INNER JOIN Colours_3NF
USING (ColourID)

Where StockCountry= 'South Africa'
AND Colour= 'Black'
AND
(InvoiceDate LIKE '2020-01-%'
OR InvoiceDate like '2020-03-%'
OR InvoiceDate like '2020-05-%'
OR InvoiceDate like '2020-07-%'
OR InvoiceDate like '2020-09-%'
OR InvoiceDate like '2020-11-%')

Group BY UserName

Query started at 10:20:58 AM South Africa Standard Time; Query executed in 0.00 m

  UserName  StockCountry   Total         InvoiceDate Colour
0    Carel  South Africa   799.0  2020-05-04 0:00:00  Black
1    Cindy  South Africa  1999.0  2020-03-31 0:00:00  Black
2   Conrad  South Africa    93.0  2020-07-26 0:00:00  Black
3   DIMPHO  South Africa  1523.0  2020-07-02 0:00:00  Black
4   Hester  South Africa   189.0  2020-07-04 0:00:00  Black
5  Jeandre  South Africa   179.0  2020-07-28 0:00:00  Black
6    Lacin  South Africa   798.0  2020-05-18 0:00:00  Black

In [33]:
%%read_sql
SELECT  SUM(DISTINCT(Total)) as total
FROM Products_3NF AS p
INNER JOIN Locations_3NF AS l
ON l.LocationID=p.LocationID
INNER JOIN Transactions_3NF AS t
ON t.Barcode=p.Barcode
INNER JOIN Users_3NF AS u
ON u.userID=t.userID
INNER JOIN Colours_3NF
USING (ColourID)

Where StockCountry= 'South Africa'
AND Colour= 'Black'
AND
(InvoiceDate LIKE '2020-01-%'
OR InvoiceDate like '2020-03-%'
OR InvoiceDate like '2020-05-%'
OR InvoiceDate like '2020-07-%'
OR InvoiceDate like '2020-09-%'
OR InvoiceDate like '2020-11-%')

Query started at 10:21:04 AM South Africa Standard Time; Query executed in 0.00 m

    total
0  5580.0